GopalSaraf/Practicals/PSDL/include/proc/pic16f18456.inc
// Register: CWG2AS1
#define CWG2AS1 CWG2AS1
CWG2AS1                                  equ 061Dh
// bitfield definitions
CWG2AS1_AS0E_POSN                        equ 0000h
CWG2AS1_AS0E_POSITION                    equ 0000h
CWG2AS1_AS0E_SIZE                        equ 0001h
CWG2AS1_AS0E_LENGTH                      equ 0001h
CWG2AS1_AS0E_MASK                        equ 0001h
CWG2AS1_AS1E_POSN                        equ 0001h
CWG2AS1_AS1E_POSITION                    equ 0001h
CWG2AS1_AS1E_SIZE                        equ 0001h
CWG2AS1_AS1E_LENGTH                      equ 0001h
CWG2AS1_AS1E_MASK                        equ 0002h
CWG2AS1_AS2E_POSN                        equ 0002h
CWG2AS1_AS2E_POSITION                    equ 0002h
CWG2AS1_AS2E_SIZE                        equ 0001h
CWG2AS1_AS2E_LENGTH                      equ 0001h
CWG2AS1_AS2E_MASK                        equ 0004h
CWG2AS1_AS3E_POSN                        equ 0003h
CWG2AS1_AS3E_POSITION                    equ 0003h
CWG2AS1_AS3E_SIZE                        equ 0001h
CWG2AS1_AS3E_LENGTH                      equ 0001h
CWG2AS1_AS3E_MASK                        equ 0008h
CWG2AS1_AS4E_POSN                        equ 0004h
CWG2AS1_AS4E_POSITION                    equ 0004h
CWG2AS1_AS4E_SIZE                        equ 0001h
CWG2AS1_AS4E_LENGTH                      equ 0001h
CWG2AS1_AS4E_MASK                        equ 0010h
CWG2AS1_AS5E_POSN                        equ 0005h
CWG2AS1_AS5E_POSITION                    equ 0005h
CWG2AS1_AS5E_SIZE                        equ 0001h
CWG2AS1_AS5E_LENGTH                      equ 0001h
CWG2AS1_AS5E_MASK                        equ 0020h
CWG2AS1_AS6E_POSN                        equ 0006h
CWG2AS1_AS6E_POSITION                    equ 0006h
CWG2AS1_AS6E_SIZE                        equ 0001h
CWG2AS1_AS6E_LENGTH                      equ 0001h
CWG2AS1_AS6E_MASK                        equ 0040h

// Register: CWG2STR
#define CWG2STR CWG2STR
CWG2STR                                  equ 061Eh
// bitfield definitions
CWG2STR_STRA_POSN                        equ 0000h
CWG2STR_STRA_POSITION                    equ 0000h
CWG2STR_STRA_SIZE                        equ 0001h
CWG2STR_STRA_LENGTH                      equ 0001h
CWG2STR_STRA_MASK                        equ 0001h
CWG2STR_STRB_POSN                        equ 0001h
CWG2STR_STRB_POSITION                    equ 0001h
CWG2STR_STRB_SIZE                        equ 0001h
CWG2STR_STRB_LENGTH                      equ 0001h
CWG2STR_STRB_MASK                        equ 0002h
CWG2STR_STRC_POSN                        equ 0002h
CWG2STR_STRC_POSITION                    equ 0002h
CWG2STR_STRC_SIZE                        equ 0001h
CWG2STR_STRC_LENGTH                      equ 0001h
CWG2STR_STRC_MASK                        equ 0004h
CWG2STR_STRD_POSN                        equ 0003h
CWG2STR_STRD_POSITION                    equ 0003h
CWG2STR_STRD_SIZE                        equ 0001h
CWG2STR_STRD_LENGTH                      equ 0001h
CWG2STR_STRD_MASK                        equ 0008h
CWG2STR_OVRA_POSN                        equ 0004h
CWG2STR_OVRA_POSITION                    equ 0004h
CWG2STR_OVRA_SIZE                        equ 0001h
CWG2STR_OVRA_LENGTH                      equ 0001h
CWG2STR_OVRA_MASK                        equ 0010h
CWG2STR_OVRB_POSN                        equ 0005h
CWG2STR_OVRB_POSITION                    equ 0005h
CWG2STR_OVRB_SIZE                        equ 0001h
CWG2STR_OVRB_LENGTH                      equ 0001h
CWG2STR_OVRB_MASK                        equ 0020h
CWG2STR_OVRC_POSN                        equ 0006h
CWG2STR_OVRC_POSITION                    equ 0006h
CWG2STR_OVRC_SIZE                        equ 0001h
CWG2STR_OVRC_LENGTH                      equ 0001h
CWG2STR_OVRC_MASK                        equ 0040h
CWG2STR_OVRD_POSN                        equ 0007h
CWG2STR_OVRD_POSITION                    equ 0007h
CWG2STR_OVRD_SIZE                        equ 0001h
CWG2STR_OVRD_LENGTH                      equ 0001h
CWG2STR_OVRD_MASK                        equ 0080h
CWG2STR_CWG2STRA_POSN                    equ 0000h
CWG2STR_CWG2STRA_POSITION                equ 0000h
CWG2STR_CWG2STRA_SIZE                    equ 0001h
CWG2STR_CWG2STRA_LENGTH                  equ 0001h
CWG2STR_CWG2STRA_MASK                    equ 0001h
CWG2STR_CWG2STRB_POSN                    equ 0001h
CWG2STR_CWG2STRB_POSITION                equ 0001h
CWG2STR_CWG2STRB_SIZE                    equ 0001h
CWG2STR_CWG2STRB_LENGTH                  equ 0001h
CWG2STR_CWG2STRB_MASK                    equ 0002h
CWG2STR_CWG2STRC_POSN                    equ 0002h
CWG2STR_CWG2STRC_POSITION                equ 0002h
CWG2STR_CWG2STRC_SIZE                    equ 0001h
CWG2STR_CWG2STRC_LENGTH                  equ 0001h
CWG2STR_CWG2STRC_MASK                    equ 0004h
CWG2STR_CWG2STRD_POSN                    equ 0003h
CWG2STR_CWG2STRD_POSITION                equ 0003h
CWG2STR_CWG2STRD_SIZE                    equ 0001h
CWG2STR_CWG2STRD_LENGTH                  equ 0001h
CWG2STR_CWG2STRD_MASK                    equ 0008h
CWG2STR_CWG2OVRA_POSN                    equ 0004h
CWG2STR_CWG2OVRA_POSITION                equ 0004h
CWG2STR_CWG2OVRA_SIZE                    equ 0001h
CWG2STR_CWG2OVRA_LENGTH                  equ 0001h
CWG2STR_CWG2OVRA_MASK                    equ 0010h
CWG2STR_CWG2OVRB_POSN                    equ 0005h
CWG2STR_CWG2OVRB_POSITION                equ 0005h
CWG2STR_CWG2OVRB_SIZE                    equ 0001h
CWG2STR_CWG2OVRB_LENGTH                  equ 0001h
CWG2STR_CWG2OVRB_MASK                    equ 0020h
CWG2STR_CWG2OVRC_POSN                    equ 0006h
CWG2STR_CWG2OVRC_POSITION                equ 0006h
CWG2STR_CWG2OVRC_SIZE                    equ 0001h
CWG2STR_CWG2OVRC_LENGTH                  equ 0001h
CWG2STR_CWG2OVRC_MASK                    equ 0040h
CWG2STR_CWG2OVRD_POSN                    equ 0007h
CWG2STR_CWG2OVRD_POSITION                equ 0007h
CWG2STR_CWG2OVRD_SIZE                    equ 0001h
CWG2STR_CWG2OVRD_LENGTH                  equ 0001h
CWG2STR_CWG2OVRD_MASK                    equ 0080h

// Register: CWG3CLK
#define CWG3CLK CWG3CLK
CWG3CLK                                  equ 068Ch
// bitfield definitions
CWG3CLK_CLK_POSN                         equ 0000h
CWG3CLK_CLK_POSITION                     equ 0000h
CWG3CLK_CLK_SIZE                         equ 0001h
CWG3CLK_CLK_LENGTH                       equ 0001h
CWG3CLK_CLK_MASK                         equ 0001h
CWG3CLK_CWG3CS_POSN                      equ 0000h
CWG3CLK_CWG3CS_POSITION                  equ 0000h
CWG3CLK_CWG3CS_SIZE                      equ 0001h
CWG3CLK_CWG3CS_LENGTH                    equ 0001h
CWG3CLK_CWG3CS_MASK                      equ 0001h

// Register: CWG3ISM
#define CWG3ISM CWG3ISM
CWG3ISM                                  equ 068Dh
// bitfield definitions
CWG3ISM_DAT_POSN                         equ 0000h
CWG3ISM_DAT_POSITION                     equ 0000h
CWG3ISM_DAT_SIZE                         equ 0004h
CWG3ISM_DAT_LENGTH                       equ 0004h
CWG3ISM_DAT_MASK                         equ 000Fh
CWG3ISM_CWG3DAT0_POSN                    equ 0000h
CWG3ISM_CWG3DAT0_POSITION                equ 0000h
CWG3ISM_CWG3DAT0_SIZE                    equ 0001h
CWG3ISM_CWG3DAT0_LENGTH                  equ 0001h
CWG3ISM_CWG3DAT0_MASK                    equ 0001h
CWG3ISM_CWG3DAT1_POSN                    equ 0001h
CWG3ISM_CWG3DAT1_POSITION                equ 0001h
CWG3ISM_CWG3DAT1_SIZE                    equ 0001h
CWG3ISM_CWG3DAT1_LENGTH                  equ 0001h
CWG3ISM_CWG3DAT1_MASK                    equ 0002h
CWG3ISM_CWG3DAT2_POSN                    equ 0002h
CWG3ISM_CWG3DAT2_POSITION                equ 0002h
CWG3ISM_CWG3DAT2_SIZE                    equ 0001h
CWG3ISM_CWG3DAT2_LENGTH                  equ 0001h
CWG3ISM_CWG3DAT2_MASK                    equ 0004h
CWG3ISM_CWG3DAT3_POSN                    equ 0003h
CWG3ISM_CWG3DAT3_POSITION                equ 0003h
CWG3ISM_CWG3DAT3_SIZE                    equ 0001h
CWG3ISM_CWG3DAT3_LENGTH                  equ 0001h
CWG3ISM_CWG3DAT3_MASK                    equ 0008h

