GopalSaraf/Practicals/PSDL/include/proc/pic16f18456.inc
// Register: CLC3SEL2
#define CLC3SEL2 CLC3SEL2
CLC3SEL2                                 equ 01E28h
// bitfield definitions
CLC3SEL2_LC3D3S0_POSN                    equ 0000h
CLC3SEL2_LC3D3S0_POSITION                equ 0000h
CLC3SEL2_LC3D3S0_SIZE                    equ 0001h
CLC3SEL2_LC3D3S0_LENGTH                  equ 0001h
CLC3SEL2_LC3D3S0_MASK                    equ 0001h
CLC3SEL2_LC3D3S1_POSN                    equ 0001h
CLC3SEL2_LC3D3S1_POSITION                equ 0001h
CLC3SEL2_LC3D3S1_SIZE                    equ 0001h
CLC3SEL2_LC3D3S1_LENGTH                  equ 0001h
CLC3SEL2_LC3D3S1_MASK                    equ 0002h
CLC3SEL2_LC3D3S2_POSN                    equ 0002h
CLC3SEL2_LC3D3S2_POSITION                equ 0002h
CLC3SEL2_LC3D3S2_SIZE                    equ 0001h
CLC3SEL2_LC3D3S2_LENGTH                  equ 0001h
CLC3SEL2_LC3D3S2_MASK                    equ 0004h
CLC3SEL2_LC3D3S3_POSN                    equ 0003h
CLC3SEL2_LC3D3S3_POSITION                equ 0003h
CLC3SEL2_LC3D3S3_SIZE                    equ 0001h
CLC3SEL2_LC3D3S3_LENGTH                  equ 0001h
CLC3SEL2_LC3D3S3_MASK                    equ 0008h
CLC3SEL2_LC3D3S4_POSN                    equ 0004h
CLC3SEL2_LC3D3S4_POSITION                equ 0004h
CLC3SEL2_LC3D3S4_SIZE                    equ 0001h
CLC3SEL2_LC3D3S4_LENGTH                  equ 0001h
CLC3SEL2_LC3D3S4_MASK                    equ 0010h
CLC3SEL2_LC3D3S5_POSN                    equ 0005h
CLC3SEL2_LC3D3S5_POSITION                equ 0005h
CLC3SEL2_LC3D3S5_SIZE                    equ 0001h
CLC3SEL2_LC3D3S5_LENGTH                  equ 0001h
CLC3SEL2_LC3D3S5_MASK                    equ 0020h
CLC3SEL2_LC3D3S_POSN                     equ 0000h
CLC3SEL2_LC3D3S_POSITION                 equ 0000h
CLC3SEL2_LC3D3S_SIZE                     equ 0008h
CLC3SEL2_LC3D3S_LENGTH                   equ 0008h
CLC3SEL2_LC3D3S_MASK                     equ 00FFh
CLC3SEL2_D3S_POSN                        equ 0000h
CLC3SEL2_D3S_POSITION                    equ 0000h
CLC3SEL2_D3S_SIZE                        equ 0008h
CLC3SEL2_D3S_LENGTH                      equ 0008h
CLC3SEL2_D3S_MASK                        equ 00FFh
CLC3SEL2_D3S0_POSN                       equ 0000h
CLC3SEL2_D3S0_POSITION                   equ 0000h
CLC3SEL2_D3S0_SIZE                       equ 0001h
CLC3SEL2_D3S0_LENGTH                     equ 0001h
CLC3SEL2_D3S0_MASK                       equ 0001h
CLC3SEL2_D3S1_POSN                       equ 0001h
CLC3SEL2_D3S1_POSITION                   equ 0001h
CLC3SEL2_D3S1_SIZE                       equ 0001h
CLC3SEL2_D3S1_LENGTH                     equ 0001h
CLC3SEL2_D3S1_MASK                       equ 0002h
CLC3SEL2_D3S2_POSN                       equ 0002h
CLC3SEL2_D3S2_POSITION                   equ 0002h
CLC3SEL2_D3S2_SIZE                       equ 0001h
CLC3SEL2_D3S2_LENGTH                     equ 0001h
CLC3SEL2_D3S2_MASK                       equ 0004h
CLC3SEL2_D3S3_POSN                       equ 0003h
CLC3SEL2_D3S3_POSITION                   equ 0003h
CLC3SEL2_D3S3_SIZE                       equ 0001h
CLC3SEL2_D3S3_LENGTH                     equ 0001h
CLC3SEL2_D3S3_MASK                       equ 0008h
CLC3SEL2_D3S4_POSN                       equ 0004h
CLC3SEL2_D3S4_POSITION                   equ 0004h
CLC3SEL2_D3S4_SIZE                       equ 0001h
CLC3SEL2_D3S4_LENGTH                     equ 0001h
CLC3SEL2_D3S4_MASK                       equ 0010h
CLC3SEL2_D3S5_POSN                       equ 0005h
CLC3SEL2_D3S5_POSITION                   equ 0005h
CLC3SEL2_D3S5_SIZE                       equ 0001h
CLC3SEL2_D3S5_LENGTH                     equ 0001h
CLC3SEL2_D3S5_MASK                       equ 0020h

// Register: CLC3SEL3
#define CLC3SEL3 CLC3SEL3
CLC3SEL3                                 equ 01E29h
// bitfield definitions
CLC3SEL3_LC3D4S0_POSN                    equ 0000h
CLC3SEL3_LC3D4S0_POSITION                equ 0000h
CLC3SEL3_LC3D4S0_SIZE                    equ 0001h
CLC3SEL3_LC3D4S0_LENGTH                  equ 0001h
CLC3SEL3_LC3D4S0_MASK                    equ 0001h
CLC3SEL3_LC3D4S1_POSN                    equ 0001h
CLC3SEL3_LC3D4S1_POSITION                equ 0001h
CLC3SEL3_LC3D4S1_SIZE                    equ 0001h
CLC3SEL3_LC3D4S1_LENGTH                  equ 0001h
CLC3SEL3_LC3D4S1_MASK                    equ 0002h
CLC3SEL3_LC3D4S2_POSN                    equ 0002h
CLC3SEL3_LC3D4S2_POSITION                equ 0002h
CLC3SEL3_LC3D4S2_SIZE                    equ 0001h
CLC3SEL3_LC3D4S2_LENGTH                  equ 0001h
CLC3SEL3_LC3D4S2_MASK                    equ 0004h
CLC3SEL3_LC3D4S3_POSN                    equ 0003h
CLC3SEL3_LC3D4S3_POSITION                equ 0003h
CLC3SEL3_LC3D4S3_SIZE                    equ 0001h
CLC3SEL3_LC3D4S3_LENGTH                  equ 0001h
CLC3SEL3_LC3D4S3_MASK                    equ 0008h
CLC3SEL3_LC3D4S4_POSN                    equ 0004h
CLC3SEL3_LC3D4S4_POSITION                equ 0004h
CLC3SEL3_LC3D4S4_SIZE                    equ 0001h
CLC3SEL3_LC3D4S4_LENGTH                  equ 0001h
CLC3SEL3_LC3D4S4_MASK                    equ 0010h
CLC3SEL3_LC3D4S5_POSN                    equ 0005h
CLC3SEL3_LC3D4S5_POSITION                equ 0005h
CLC3SEL3_LC3D4S5_SIZE                    equ 0001h
CLC3SEL3_LC3D4S5_LENGTH                  equ 0001h
CLC3SEL3_LC3D4S5_MASK                    equ 0020h
CLC3SEL3_LC3D4S_POSN                     equ 0000h
CLC3SEL3_LC3D4S_POSITION                 equ 0000h
CLC3SEL3_LC3D4S_SIZE                     equ 0008h
CLC3SEL3_LC3D4S_LENGTH                   equ 0008h
CLC3SEL3_LC3D4S_MASK                     equ 00FFh
CLC3SEL3_D4S_POSN                        equ 0000h
CLC3SEL3_D4S_POSITION                    equ 0000h
CLC3SEL3_D4S_SIZE                        equ 0008h
CLC3SEL3_D4S_LENGTH                      equ 0008h
CLC3SEL3_D4S_MASK                        equ 00FFh
CLC3SEL3_D4S0_POSN                       equ 0000h
CLC3SEL3_D4S0_POSITION                   equ 0000h
CLC3SEL3_D4S0_SIZE                       equ 0001h
CLC3SEL3_D4S0_LENGTH                     equ 0001h
CLC3SEL3_D4S0_MASK                       equ 0001h
CLC3SEL3_D4S1_POSN                       equ 0001h
CLC3SEL3_D4S1_POSITION                   equ 0001h
CLC3SEL3_D4S1_SIZE                       equ 0001h
CLC3SEL3_D4S1_LENGTH                     equ 0001h
CLC3SEL3_D4S1_MASK                       equ 0002h
CLC3SEL3_D4S2_POSN                       equ 0002h
CLC3SEL3_D4S2_POSITION                   equ 0002h
CLC3SEL3_D4S2_SIZE                       equ 0001h
CLC3SEL3_D4S2_LENGTH                     equ 0001h
CLC3SEL3_D4S2_MASK                       equ 0004h
CLC3SEL3_D4S3_POSN                       equ 0003h
CLC3SEL3_D4S3_POSITION                   equ 0003h
CLC3SEL3_D4S3_SIZE                       equ 0001h
CLC3SEL3_D4S3_LENGTH                     equ 0001h
CLC3SEL3_D4S3_MASK                       equ 0008h
CLC3SEL3_D4S4_POSN                       equ 0004h
CLC3SEL3_D4S4_POSITION                   equ 0004h
CLC3SEL3_D4S4_SIZE                       equ 0001h
CLC3SEL3_D4S4_LENGTH                     equ 0001h
CLC3SEL3_D4S4_MASK                       equ 0010h
CLC3SEL3_D4S5_POSN                       equ 0005h
CLC3SEL3_D4S5_POSITION                   equ 0005h
CLC3SEL3_D4S5_SIZE                       equ 0001h
CLC3SEL3_D4S5_LENGTH                     equ 0001h
CLC3SEL3_D4S5_MASK                       equ 0020h

